### SQL Queries 9

In [ ]:
# Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

    # Check the number of rentals for each customer for May

    # Check the number of rentals for each customer for June

In [30]:
import mysql.connector
import pandas as pd

In [3]:
from mysql.connector import connect
from getpass import getpass

In [4]:
# we need to create an engine to connect to the database 
#Connection to an engine (sacamos los datos de MySQL workbench "session" abajo)

db=connect(
    host = "localhost",
    user ="root",
    passwd = getpass("Enter password: "), 
    database="sakila"
)

Enter password:  ········

In [6]:
cursor = db.cursor()

In [7]:
cursor.execute("SHOW DATABASES")

In [8]:
databases = cursor.fetchall() # Check databases
print(databases)

[('bank',), ('bank_demo',), ('basket',), ('basketball',), ('basketball2',), ('basketdraft',), ('basketnba',), ('information_schema',), ('mysql',), ('performance_schema',), ('sakila',), ('sys',)]

In [180]:
# We write the query
query = "SELECT COUNT(rental_id) as num_rentals,customer_ID FROM rentals_may GROUP BY customer_ID ORDER BY customer_ID;"

In [181]:
# get the records from the table rentals_may
cursor.execute(query)

In [182]:
# fetch the records of the query  "number of rentals for each customer for May"
records_may = cursor.fetchall()
for record in records_may:
    df1 = pd.DataFrame(records_may)

In [183]:
df1.head(5)

   0  1
0  2  1
1  1  2
2  2  3
3  3  5
4  3  6

In [184]:
df1["num_rentals_may"] = df1[0]
df1["customer_id"] = df1[1]

In [185]:
df1.head(5)

   0  1  num_rentals_may  customer_id
0  2  1                2            1
1  1  2                1            2
2  2  3                2            3
3  3  5                3            5
4  3  6                3            6

In [186]:
# fetch the records of the query "number of rentals for each customer for June"

query2 = "SELECT COUNT(rental_id) as num_rentals,customer_ID FROM rentals_june GROUP BY customer_ID ORDER BY customer_ID;"
cursor.execute(query2)
records_june = cursor.fetchall()
for record in records_june:
    df2 = pd.DataFrame(records_june)

In [187]:
df2["num_rentals_june"] = df2[0]
df2["customer_id"] = df2[1]

In [188]:
df2.head(5)

   0  1  num_rentals_june  customer_id
0  7  1                 7            1
1  1  2                 1            2
2  4  3                 4            3
3  6  4                 6            4
4  5  5                 5            5

In [200]:
df1.columns

Index([0, 1, 'num_rentals_may', 'customer_id'], dtype='object')

In [207]:
df2.columns

Index([0, 1, 'num_rentals_june', 'customer_id'], dtype='object')

In [208]:
df1 = df1[["num_rentals_may", "customer_id"]]
df2 = df2[["num_rentals_june", "customer_id"]]

In [209]:
df2

     num_rentals_june  customer_id
0                   7            1
1                   1            2
2                   4            3
3                   6            4
4                   5            5
..                ...          ...
585                 2          595
586                 2          596
587                 3          597
588                 1          598
589                 4          599

[590 rows x 2 columns]

In [225]:
df_final = pd.merge(df1,df2,on = "customer_id")

In [226]:
df_final.head(5)

   num_rentals_may  customer_id  num_rentals_june
0                2            1                 7
1                1            2                 1
2                2            3                 4
3                3            5                 5
4                3            6                 4

In [227]:
df_final.set_index(["customer_id"])

             num_rentals_may  num_rentals_june
customer_id
1                          2                 7
2                          1                 1
3                          2                 4
5                          3                 5
6                          3                 4
...                      ...               ...
594                        4                 6
595                        1                 2
596                        6                 2
597                        2                 3
599                        1                 4

[512 rows x 2 columns]

In [223]:
# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.


def cust_dif(data1):
    customer_id = df_final3
    for i in data1["customer_id"]:
        diff = df_final3["num_rentals_june"] - df_final3["num_rentals_may"]
    return diff

In [224]:
cust_dif(df_final3)

0      5
1      0
2      2
3      2
4      1
      ..
507    2
508    1
509   -4
510    1
511    3
Length: 512, dtype: int64